import java.util.Scanner;

public class UserArray {

    public static void main(String[] args) {   // точка входу
        Scanner in = new Scanner(System.in);

        int val = in.nextInt();  // значення яке ми добавляємо в масив
        int index = in.nextInt();  // індекс масиву в який вставляєм значення val

        int[] arrays = {0,0,0,0,0,0,0,0,0,0};   // створюємо масив із  елементами 0 "для наглядності "

        int[] newArray = new int[arrays.length + 1];  // створюємо новий масив який приймає в себе довжину масиву arrays та додає + 1 елемент
        for (int i = 0; i < index; i++) {   // через цикл 0 й індекс масиву newArray додаємо до масиву arrays
            newArray[i] = arrays[i];
        }
        newArray[index] = val;    // нове значення  val 100 додаємо до 0 го. індексу масиму

        for (int i = index; i < arrays.length; i++) {    //  на даному етапі робемо перебір масиву по всій його довжині +1 елемент
            newArray[i + 1] = arrays[i];
        }
        for (int iii : newArray) {    // через цикл for each виводимо масив з новими вже внесеними даними.
            System.out.print(" " +  iii);
        }
    }
}




//        Используя IntelliJ IDEA, создайте класс UserArray. Требуется: Создать метод,
//        который будет выполнять увеличение длины массива переданного в качестве аргумента,
//        на 1 элемент. Элементы массива, должны сохранить свое значение и порядок индексов.
//        Создайте метод, который принимает два аргумента, первый аргумент – типа int [] array, второй аргумент – типа int value. +

//        В теле метода реализуйте возможность добавления второго аргумента метода в массив по индексу 0,
//        при этом длина нового массива, должна увеличиться на 1 элемент,
//        а элементы получаемого массива в качестве первого аргумента должны скопироваться
//        в новый массив начиная с индекса 1.

